tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "cmake"
brew "fd"
brew "fish", args: ["HEAD"]
brew "git"
brew "neovim"
brew "ripgrep"
brew "rust-analyzer"
brew "tree"
brew "youtube-dl"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-modern-black-variant-icon", "with-no-titlebar"]
cask "cursorcerer"
cask "google-drive-file-stream"
cask "gpg-suite"
cask "hammerspoon"
cask "keybase"
cask "kitty"
cask "launchbar"
cask "linear-linear"
cask "maccy"
cask "protonvpn"
cask "spectacle"
cask "steam"
cask "transmit"
cask "typinator"
cask "vlc"
